OPENFOAM_PATH/cases/opposedJet_E18/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// E18 Stage1: Ember-matched gap L=0.008 m (xLeft=-0.004 … xRight=+0.004).
// Mid-plane mixing layer refined. Total cells = 200×100 = 20000.

scale   1;

vertices
(
    (0.0     -0.006 -0.0005)
    (0.0028  -0.006 -0.0005)
    (0.0052  -0.006 -0.0005)
    (0.008   -0.006 -0.0005)
    (0.0      0.006 -0.0005)
    (0.0028   0.006 -0.0005)
    (0.0052   0.006 -0.0005)
    (0.008    0.006 -0.0005)
    (0.0     -0.006  0.0005)
    (0.0028  -0.006  0.0005)
    (0.0052  -0.006  0.0005)
    (0.008   -0.006  0.0005)
    (0.0      0.006  0.0005)
    (0.0028   0.006  0.0005)
    (0.0052   0.006  0.0005)
    (0.008    0.006  0.0005)
);

blocks
(
    // fuel side — refine toward mid
    hex (0 1 5 4 8 9 13 12) (50 100 1) simpleGrading (0.25 1 1)
    // mid mixing layer
    hex (1 2 6 5 9 10 14 13) (100 100 1) simpleGrading (1 1 1)
    // air side — refine toward mid
    hex (2 3 7 6 10 11 15 14) (50 100 1) simpleGrading (4 1 1)
);

boundary
(
    fuel
    {
        type patch;
        faces
        (
            (0 8 12 4)
        );
    }
    air
    {
        type patch;
        faces
        (
            (3 7 15 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
